{"id":"81e5fe8a-bb37-4039-8d6d-9c570a07c185","updated_at":"2025-05-24T12:54:44.009Z","updated_by":"elastic","created_at":"2025-05-24T12:54:44.009Z","created_by":"elastic","name":"brute force attempt","tags":[],"interval":"2m","enabled":true,"revision":0,"description":"brute force attempt detection","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"3600h","kibana_siem_app_url":"http://192.168.1.118:5601/app/security"},"author":[],"false_positives":[],"from":"now-12960120s","rule_id":"3289df2c-2221-43cb-a24e-3d6f8af6f1f8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"eql","language":"eql","data_view_id":"0818b0f6-a023-4e04-9701-6ce42513af5d","query":"sequence by hostname with maxspan=2m\n  [ authentication where program == \"login\" and startsWith(auth_message, \"FAILED LOGIN\") ]\n  [ authentication where program == \"login\" and startsWith(auth_message, \"FAILED LOGIN\") ]\n  [ authentication where program == \"login\" and startsWith(auth_message, \"FAILED LOGIN\") ]\n  [ authentication where program == \"login\" and startsWith(auth_message, \"TOO MANY LOGIN TRIES\") ]\n","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
